<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"4870951b0303c85e2671eb41a1e2ae227a49bff101b53fd3aefe33483430cfe3","plan_job_ref":"Job Write Terraform Plan to Pull Request #71 at https://github.com/hackforla/devops-security/actions/runs/13148323127","plan_out_hash":"4b63d7316c7d0fa9685ac7aa60139f7ea5cc47a6a3e9325de7898cd53dc84669","plan_hash":"a74b2d94b6cc71af5728d3a98b59b82fbe9a7401ca6a2e450b103423dd1dfdb4","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __terraform__
With backend config files: `terraform/prod.backend.tfvars`
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.iam_user_bltomlin.aws_iam_user.user will be created
+   resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "bltomlin"
+       path          = "/"
+       tags          = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       tags_all      = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       unique_id     = (known after apply)
    }

  # module.iam_user_bltomlin.aws_iam_user_group_membership.user_group_membership will be created
+   resource "aws_iam_user_group_membership" "user_group_membership" {
+       groups = [
+           "read-only-group",
        ]
+       id     = (known after apply)
+       user   = "bltomlin"
    }

  # module.iam_user_bltomlin.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "bltomlin"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #71](https://github.com/hackforla/devops-security/actions/runs/13148323127)